# Chapter 7: Data Cleaning and Preperation

## 7.1: Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
float_data=pd.Series([1.2,-3.5,np.nan,0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data=pd.Series(["aardvark",np.nan,None,"avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [5]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [6]:
float_data=pd.Series([1,2,None],dtype="float64")
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [7]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

### Filtering Out Missing Data

In [8]:
data=pd.Series([1,np.nan,3.5,np.nan,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data=pd.DataFrame([[1,6.5,3],[1,np.nan,np.nan],[np.nan,np.nan,np.nan],[np.nan,6.5,3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [13]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4]=np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(axis="columns",how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
df=pd.DataFrame(np.random.standard_normal((7,3)))
df.iloc[:4,1]=np.nan
df.iloc[:2,2]=np.nan
df

          0         1         2
0 -0.164878       NaN       NaN
1  1.168743       NaN       NaN
2 -0.682002       NaN  0.699481
3 -2.457978       NaN -0.391094
4  0.590568 -0.231368  1.958544
5 -1.134485 -1.535288 -0.366198
6  1.114480 -0.845630 -0.554305

In [17]:
df.dropna()

          0         1         2
4  0.590568 -0.231368  1.958544
5 -1.134485 -1.535288 -0.366198
6  1.114480 -0.845630 -0.554305

In [18]:
df.dropna(axis="columns")

          0
0 -0.164878
1  1.168743
2 -0.682002
3 -2.457978
4  0.590568
5 -1.134485
6  1.114480

In [19]:
df.dropna(how="all",axis="columns")

          0         1         2
0 -0.164878       NaN       NaN
1  1.168743       NaN       NaN
2 -0.682002       NaN  0.699481
3 -2.457978       NaN -0.391094
4  0.590568 -0.231368  1.958544
5 -1.134485 -1.535288 -0.366198
6  1.114480 -0.845630 -0.554305

In [20]:
df.dropna(how="all")

          0         1         2
0 -0.164878       NaN       NaN
1  1.168743       NaN       NaN
2 -0.682002       NaN  0.699481
3 -2.457978       NaN -0.391094
4  0.590568 -0.231368  1.958544
5 -1.134485 -1.535288 -0.366198
6  1.114480 -0.845630 -0.554305

In [21]:
df.dropna(axis="rows")

          0         1         2
4  0.590568 -0.231368  1.958544
5 -1.134485 -1.535288 -0.366198
6  1.114480 -0.845630 -0.554305

In [22]:
df.dropna(thresh=2)

          0         1         2
2 -0.682002       NaN  0.699481
3 -2.457978       NaN -0.391094
4  0.590568 -0.231368  1.958544
5 -1.134485 -1.535288 -0.366198
6  1.114480 -0.845630 -0.554305

### Filling In Missing Data

In [23]:
df

          0         1         2
0 -0.164878       NaN       NaN
1  1.168743       NaN       NaN
2 -0.682002       NaN  0.699481
3 -2.457978       NaN -0.391094
4  0.590568 -0.231368  1.958544
5 -1.134485 -1.535288 -0.366198
6  1.114480 -0.845630 -0.554305

In [24]:
df.fillna(0)

          0         1         2
0 -0.164878  0.000000  0.000000
1  1.168743  0.000000  0.000000
2 -0.682002  0.000000  0.699481
3 -2.457978  0.000000 -0.391094
4  0.590568 -0.231368  1.958544
5 -1.134485 -1.535288 -0.366198
6  1.114480 -0.845630 -0.554305

In [25]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.164878  0.500000  0.000000
1  1.168743  0.500000  0.000000
2 -0.682002  0.500000  0.699481
3 -2.457978  0.500000 -0.391094
4  0.590568 -0.231368  1.958544
5 -1.134485 -1.535288 -0.366198
6  1.114480 -0.845630 -0.554305

In [26]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

In [27]:
df

          0         1         2
0  0.738229  0.254868 -1.381167
1 -1.590489 -0.268352 -0.576400
2  0.885241  1.195300  0.350663
3  0.598671  0.505648 -0.380281
4  1.876603 -0.075068 -0.428859
5 -0.029922  0.184366 -0.322968

In [28]:
df.iloc[2:,1]=np.nan
df.iloc[4:,2]=np.nan
df

          0         1         2
0  0.738229  0.254868 -1.381167
1 -1.590489 -0.268352 -0.576400
2  0.885241       NaN  0.350663
3  0.598671       NaN -0.380281
4  1.876603       NaN       NaN
5 -0.029922       NaN       NaN

In [29]:
df.fillna(method="ffill")

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_34732\3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0  0.738229  0.254868 -1.381167
1 -1.590489 -0.268352 -0.576400
2  0.885241 -0.268352  0.350663
3  0.598671 -0.268352 -0.380281
4  1.876603 -0.268352 -0.380281
5 -0.029922 -0.268352 -0.380281

In [30]:
df.ffill()

          0         1         2
0  0.738229  0.254868 -1.381167
1 -1.590489 -0.268352 -0.576400
2  0.885241 -0.268352  0.350663
3  0.598671 -0.268352 -0.380281
4  1.876603 -0.268352 -0.380281
5 -0.029922 -0.268352 -0.380281

In [31]:
df.fillna(method="ffill",limit=2)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_34732\3768739427.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill",limit=2)

          0         1         2
0  0.738229  0.254868 -1.381167
1 -1.590489 -0.268352 -0.576400
2  0.885241 -0.268352  0.350663
3  0.598671 -0.268352 -0.380281
4  1.876603       NaN -0.380281
5 -0.029922       NaN -0.380281

In [32]:
data=pd.Series([1,np.nan,3.5,np.nan,7])
data
data.fillna(data.mean())

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2: Data Transformation

### Removing Duplicates

In [33]:
data=pd.DataFrame({"k1":["one","two"]*3+["two"],
                   "k2":[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [34]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [35]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [36]:
data["v1"]=range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [37]:
data.drop_duplicates(["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [38]:
data.drop_duplicates(["k1","k2"])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [40]:
data.drop_duplicates(["k1","k2"],keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [42]:
data=pd.DataFrame({"food":["bacon","pulled pork","bacon","pastrami","corned beef","bacon","pastrami","honey ham","nova lox"],
                   "ounces":[4,3,12,6,7.5,8,3,5,6]})

In [43]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [44]:
meat_to_animal={
    "bacon":"pig",
    "pulled pork":"pig",
    "pastrami":"cow",
    "corned beef":"cow",
    "honey ham":"pig",
    "nova lox":"salmon"
}

In [45]:
data["animal"]=data["food"].map(meat_to_animal)

In [46]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [49]:
def get_animal(x):
    return meat_to_animal[x]

In [53]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [54]:
meat_to_animal[data["food"][1]]

'pig'

### Replacing Values

In [55]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [57]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [58]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [59]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [60]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [61]:
data=pd.DataFrame(np.arange(12).reshape((3,4)),
                  index=["Ohio","Colorado","New York"],
                  columns=["one","two","three","four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [62]:
def transform(x):
    return x[:4].upper()

In [65]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [66]:
data.index=data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [67]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11